import { Link } from 'react-router-dom';

export default function Members() {
  return (
    <div className="container mx-auto px-4 py-8 md:py-12">
      <div className="max-w-3xl mx-auto bg-white p-6 md:p-10 rounded-lg shadow-md">
        
        <h2 className="text-2xl md:text-3xl font-bold mb-6 text-center text-blue-800 border-b-2 border-blue-100 pb-4">
          法政通信メディア創立者から
        </h2>
        
        <div className="mb-10 text-gray-700 leading-relaxed">
          <p className="mb-4">
            <br />
           卒業を迎えるにあたり、私がこの"法政通信メディア"を立ち上げた背景にある、一つの大切な「約束」についてお話しさせてください。
           <br />   <br />   
           私の大学生活は、最初から順風満帆だったわけではありません。無駄に大きい設題総覧や学習のしおりを頑張って読み込むも勘違いをしてミスの連発もありましたし、スクーリングではどう振る舞えばいいのか分からず、一人で途方に暮れていた時期もありました。そんな暗闇の中にいた私に優しさで手を差し伸べてくれた人がたくさんがいました。そんな方々に助けられ、ようやく前を向くことができた時、とある人の去り際に掛けられた言葉が今も忘れられません。   
   <br />「いつか君も困っている人がいたら、助けてあげてね」   <br />
その一言が、私の心に深く根を張りました。自分が受けた恩を、ただ受け取るだけで終わらせたくない。その想いが形を変え、「情報発信」という手段で学生たちの力になるメディアの創設へと繋がりました。
   <br />このアカウントは、誰かの「困った」を「良かった」に変えるために存在しています。私がかつて救われたように、この活動が誰の前を向く希望になることを願ってきました。
   <br />このバトンを後輩の皆さんに託します。
   <br />手法や形は変わってもいい。けれど、根底にある「誰かのために」という温かな精神だけは、どうか忘れずに引き継いでいってほしいと思います。この活動が、これからも多くの学生を支える力になることを心から応援しています！
          </p>
        </div>

      </div>
    </div>
  );
}